Repository: quarkusio/pt.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: pt_br

source: Quarkus DI solution is based on the [Contexts and Dependency Injection for Java 2.0](https://docs.jboss.org/cdi/spec/2.0/cdi-spec) specification. This guide explains the basics of CDI.
pt_br: A solução Quarkus DI é baseada na especificação [Contexts and Dependency Injection for Java 2.0] https://docs.jboss.org/cdi/spec/2.0/cdi-spec . Este guia explica os princípios básicos do CDI.

source: Quarkus Development
pt_br: Desenvolvimento de Quarkus

source: Quarkus Extension Registry
pt_br: Catálogo de Extensões do Quarkus

source: Quarkus Features
pt_br: Recursos do Quarkus

source: Quarkus Newsletter
pt_br: Boletim informativo Quarkus

source: Quarkus Reactive Architecture
pt_br: Arquitetura Reativa do Quarkus

source: Quarkus Tools in Your Favorite IDE
pt_br: Ferramentas do Quarkus em seu IDE favorito

source: Quarkus Tools in your favorite IDE
pt_br: Ferramentas do Quarkus no seu IDE favorito

source: Quarkus World Tour 2023 - JUG Promotional Materials
pt_br: Quarkus World Tour 2023 - Materiais Promocionais JUG

source: Quarkus aids you on your journey to reactive. Quarkus is based on a <a href="https://quarkus.io/version/main/guides/quarkus-reactive-architecture">reactive core</a> allowing your application to mix reactive and imperative components. As an example, you can implement reactive HTTP endpoint using the <a href="https://quarkus.io/guides/resteasy-reactive">RESTEasy Reactive extension</a> as follows:
pt_br: Quarkus ajuda você em sua jornada para reativo. O Quarkus é baseado em um <a href="https://quarkus.io/version/main/guides/quarkus-reactive-architecture">núcleo reativo</a> , permitindo que sua aplicação misture componentes reativos e imperativos. Como exemplo, você pode implementar o endpoint HTTP reativo usando a <a href="https://quarkus.io/guides/resteasy-reactive">extensão RESTEasy Reactive</a> da seguinte maneira:

source: Quarkus allows the following JDBC-specific configuration of the object store included in `quarkus.transaction-manager.object-store.<property>` properties, where <property> can be:
pt_br: O Quarkus permite a seguinte configuração específica de JDBC do armazenamento de objectos incluída em `quarkus.transacion-manager.object-store.&amp;lt;property&amp;gt;` propriedades, onde &lt;property&gt; pode ser:

source: Quarkus applications are designed to run in containers.
pt_br: Aplicações Quarkus são projetadas para serem executadas em contêineres.

source: Quarkus applications are optimised for low memory usage and fast startup times.
pt_br: Aplicações Quarkus são otimizadas para baixo uso de memória e tempos de inicialização rápidos.

source: Quarkus comes with a Transaction Manager and uses it to coordinate and expose transactions to your applications. Each extension dealing with persistence will integrate with it for you. And you will explicitly interact with transactions via CDI. This guide will walk you through all that.
pt_br: O Quarkus vem com um Gerenciador de Transações e o usa para coordenar e expor transações para suas aplicações. Cada extensão que lida com persistência irá se integrar com ele para você. E você interagirá explicitamente com as transações via CDI. Este guia irá guiá-lo através de tudo isso.

source: Quarkus comes with a toolchain enabling developers from live reload all the way down to deploying a Kubernetes application. In addition, there are plugins and extensions to all major IDEs.
pt_br: O Quarkus vem com uma conjunto de ferramentas que auxilia os desenvolvedores desde o _live reload_ até a implantação de um aplicativo Kubernetes. Além disso, existem plug-ins e extensões para todos os principais IDEs.

source: Quarkus extensions optimize your applications by pushing as much work as possible to the build operation. This guide explains the rationale of Quarkus extensions and guides you through authoring your own extensions.
pt_br: As extensões do Quarkus otimizam suas aplicações enviando o máximo de trabalho possível para a operação de compilação. Este guia explica a lógica das extensões do Quarkus e orienta você através da criação de suas próprias extensões.

source: Quarkus focuses on the simplest and most useful way to use a given feature, trimming it to its most useful essence. This includes upfront analysis on how to best use a feature and guiding you in what we think is the best way to do things.
pt_br: O Quarkus se concentra na maneira mais simples e útil de usar um determinado recurso, cortando-o para sua essência mais útil. Isso inclui uma análise inicial sobre como usar melhor um recurso e orientá-lo no que achamos ser a melhor maneira de fazer as coisas.

source: Quarkus gRPC is based on https://vertx.io/docs/vertx-grpc/java/[Vert.x gRPC].
pt_br: O Quarkus gRPC é baseado no link:https://vertx.io/docs/vertx-grpc/java/[Vert.x gRPC].

source: Quarkus has been designed with this new world in mind and provides first-class support for these different paradigms. That does not mean you cannot build monoliths with Quarkus; you can do it smoothly. On the contrary, it means that the Quarkus development model morphs to adapt itself to the type of application you are developing, monolith, microservice, reactive, event-driven, functions…
pt_br: O Quarkus foi projetado com esse novo mundo em mente e fornece suporte de primeira classe para esses diferentes paradigmas. Isso não significa que você não possa construir monólitos com Quarkus; você pode fazê-lo sem problemas. Pelo contrário, isso significa que o modelo de desenvolvimento do Quarkus se transforma para se adaptar ao tipo de aplicação que você está desenvolvendo, monólito, microsserviço, reativo, orientado a eventos, funções...

source: Quarkus implements the following Specifications:
pt_br: O Quarkus implementa as seguintes especificações:

source: Quarkus includes an extension that allows developers to use Kubernetes ConfigMaps and Secrets as a configuration source, without having to mount them into the Pod running the Quarkus application or make any other modifications to their Kubernetes Deployment (or Openshift DeploymentConfig) <a href="{{site.baseurl}}/guides/kubernetes-config">Read the guide for more details.</a>
pt_br: O Quarkus inclui uma extensão que permite aos desenvolvedores usar o Kubernetes ConfigMaps e Secrets como uma fonte de configuração, sem ter que montá-los no Pod executando a aplicação Quarkus ou fazer quaisquer outras modificações em sua implantação do Kubernetes (ou Openshift DeploymentConfig) <a href="{{site.baseurl}}/guides/kubernetes-config">Leia o guia para obter mais detalhes.</a>

source: Quarkus is an Open Source project licensed under the <a href="https://www.apache.org/licenses/LICENSE-2.0">Apache License version 2.0</a>. First and foremost, it is an open community where contributions, ideas and discussions are done in the open and contributors are welcome. Let’s join forces in building the future of Java applications.
pt_br: Quarkus é um projeto Open Source licenciado sob a <a href="https://www.apache.org/licenses/LICENSE-2.0">Licença Apache versão 2.0.</a> Em primeiro lugar, é uma comunidade aberta, onde contribuições, ideias e discussões são feitas ao ar livre e os colaboradores são bem-vindos. Vamos unir forças na construção do futuro das aplicações Java.

source: Quarkus is an Open Source project licensed under the https://www.apache.org/licenses/LICENSE-2.0[Apache License version 2.0].
pt_br: Quarkus é um projeto Open Source licenciado sob o https://www.apache.org/licenses/LICENSE-2.0 [Apache License versão 2.0].

source: Quarkus is an open ecosystem and we hope to see all the extensions people need to write their apps. We are working as we speak to allow an extension to be published in separate repos and separate GAVs and thus published in Maven repos independently of Quarkus core. This will greatly simplify the publication process. Expect news soon.
pt_br: O Quarkus é um ecossistema aberto e esperamos ver todas as extensões que as pessoas precisam para escrever suas aplicações. Estamos trabalhando enquanto falamos para permitir que uma extensão seja publicada em repositórios separados e GAVs separados e, portanto, publicada em repositórios Maven independentemente do núcleo do Quarkus. Isso simplificará muito o processo de publicação. Aguarde novidades em breve.

source: Quarkus is designed to seamlessly combine the familiar imperative style code and the non-blocking, reactive style when developing applications.
pt_br: O Quarkus foi projetado para combinar perfeitamente o código de estilo imperativo que você já conhece e o estilo reativo sem bloqueio ao desenvolver aplicações.

source: Quarkus is not just about being great for writing Web Applications or Micro-Services. We’re focusing on more than the feature set: we make sure that every feature works well, simply, with little to no configuration, in the most intuitive way possible. It should be trivial to develop simple things, and easy to develop the more complex ones.
pt_br: O Quarkus não é apenas sobre ser ótimo para escrever Aplicações Web ou Micro-Serviços. Estamos nos concentrando em mais do que o conjunto de recursos: garantimos que todos os recursos funcionem bem, de forma simples, com pouca ou nenhuma configuração, da maneira mais intuitiva possível. Deve ser trivial desenvolver coisas simples, e fácil desenvolver as mais complexas.

source: Quarkus is not limited to HTTP. You can use <a href="https://quarkus.io/guides/grpc-getting-started">gRPC</a> or <a href="https://quarkus.io/guides/smallrye-graphql">GraphQL</a>, two prominent alternatives in the microservice space.
pt_br: O Quarkus não está limitado a HTTP. Você pode usar <a href="https://quarkus.io/guides/grpc-getting-started">gRPC</a> ou <a href="https://quarkus.io/guides/smallrye-graphql">GraphQL</a>, duas alternativas proeminentes no espaço de microsserviços.

source: Quarkus is published in Maven Central, check out link:/extensions[which extensions] you need and just import them in your `pom.xml` to get Quarkus. We recommend you start your Quarkus experience via our link:/get-started[Getting Started guides].
pt_br: O Quarkus é publicado no Maven Central, confira link:/extensions[quais extensões] você precisa e basta importá-los em seu 'pom.xml' para obter o Quarkus. Recomendamos que você comece sua experiência com o Quarkus através do nosso link:/get-started[Guias de introdução].

source: Quarkus is stable?
pt_br: Quarkus é estável?

source: Quarkus is the rising star for Kube Native Java as it re-imagines the Java stack to give you the performance characteristics and developer experience you need to create modern, high performing applications. Quarkus helps you use your existing skills and code in new ways and greatly reduces the technical burden when moving to a Kubernetes-centric environment.
pt_br: O Quarkus é a estrela em ascensão do Kube Native Java, pois reimagina a stack Java para fornecer as características de desempenho e a experiência de desenvolvedor necessárias para criar aplicativos modernos e de alto desempenho. O Quarkus ajuda você a usar suas habilidades e código existentes de novas maneiras e reduz consideravelmente a carga técnica ao migrar para um ambiente centrado no Kubernetes.

source: Quarkus leverages SmallRye Health, an implementation of the MicroProfile Health specification. This allows applications to provide information about their state to external viewers in a Kubernetes environment where automated processes must be able to determine whether the application should be discarded or restarted. <a href="{{site.baseurl}}/guides/microprofile-health">Read the guide for more details.</a>
pt_br: O Quarkus aproveita o SmallRye Health, uma implementação da especificação MicroProfile Health. Isso permite que as aplicações forneçam informações sobre seu estado para visualizadores externos em um ambiente Kubernetes onde os processos automatizados devem ser capazes de determinar se o aplicativo deve ser descartado ou reiniciado. <a href="{{site.baseurl}}/guides/microprofile-health">Leia o guia para obter mais detalhes.</a>

source: Quarkus makes it easy to deploy microservice applications to Kubernetes without having to understand the intricacies of the underlying Kubernetes framework. Extensions are available for Kubernetes, and Kubernetes distributions, to facilitate this process with only a minimal amount of configuration variables needed.
pt_br: O Quarkus facilita a implantação de aplicações de microsserviço no Kubernetes sem precisar entender as complexidades da estrutura subjacente do Kubernetes. Extensões estão disponíveis para Kubernetes e distribuições Kubernetes, para facilitar esse processo com apenas uma quantidade mínima de variáveis de configuração necessárias.

source: Quarkus offers unequaled performance
pt_br: O Quarkus oferece um desempenho inigualável

source: Quarkus on Kubernetes
pt_br: Quarkus no Kubernetes

source: Quarkus provides a cohesive, fun to use, full-stack framework by leveraging a growing list of hundreds of best-of-breed libraries that you love and use. All wired on a standard backbone.
pt_br: O Quarkus fornece um framework coeso, divertido de usar e full-stack, aproveitando uma lista crescente de centenas de bibliotecas disponíveis que você ama e usa. Tudo conectado em um backbone padrão.

source: Quarkus provides a cohesive, fun to use, full-stack framework by leveraging a growing list of hundreds of best-of-breed libraries that you love and use. All wired on a standard backbone. <a href="/standards">Learn more about Quarkus Extensions</a>.
pt_br: O Quarkus fornece uma estrutura coesa, divertida de usar e full-stack, aproveitando uma lista crescente de centenas de bibliotecas disponíveis que você ama e usa. Tudo conectado em um backbone padrão. <a href="/standards">Saiba mais sobre as extensões do Quarkus</a>.

source: Quarkus provides a cohesive, fun to use, full-stack framework by leveraging a growing list of over fifty best-of-breed libraries that you love and use. All wired on a standard backbone.
pt_br: O Quarkus fornece uma estrutura coesa, divertida de usar e full-stack, aproveitando uma lista crescente de mais de cinquenta bibliotecas de primeira linha que você ama e usa. Tudo conectado em um backbone padrão.

source: Quarkus provides a compatibility layer for Spring Cloud Config in the form of the spring-cloud-config-client extension.
pt_br: O Quarkus fornece uma camada de compatibilidade para o Spring Cloud Config na forma da extensão spring-cloud-config-client.

source: Quarkus provides developers the tools and capabilities to troubleshoot distributed microservices applications in Kubernetes including tracing and debugging.
pt_br: O Quarkus fornece aos desenvolvedores as ferramentas e os recursos para solucionar problemas de aplicações de microsserviços distribuídos no Kubernetes, incluindo rastreamento e depuração.

source: Quarkus tailors your application for GraalVM and HotSpot. Amazingly fast boot time, incredibly low RSS memory (not just heap size!) offering near instant scale up and high density memory utilization in container orchestration platforms like Kubernetes. We use a technique we call compile time boot.
pt_br: O Quarkus adapta seu aplicativo para GraalVM e HotSpot. Tempo de inicialização incrivelmente rápido, memória RSS incrivelmente baixa (não apenas tamanho de heap!) oferecendo aumento de escala quase instantâneo e utilização de memória de alta densidade em plataformas de orquestração de contêineres como o Kubernetes. Usamos uma técnica que chamamos de inicialização de tempo de compilação.

source: Quarkus tailors your application for GraalVM and HotSpot. Amazingly fast boot time, incredibly low RSS memory (not just heap size!) offering near instant scale up and high density memory utilization in container orchestration platforms like Kubernetes. We use a technique we call compile time boot. <a href="/container-first">Learn more.</a>
pt_br: O Quarkus adapta seu aplicativo para GraalVM e HotSpot. Tempo de inicialização incrivelmente rápido, memória RSS incrivelmente baixa (não apenas tamanho de heap!) oferecendo aumento de escala quase instantâneo e utilização de memória de alta densidade em plataformas de orquestração de contêineres como o Kubernetes. Usamos uma técnica que chamamos de inicialização de tempo de compilação. <a href="/container-first">Saiba Mais.</a>

source: Quarkus utilizes <a href="https://opentracing.io/" target="_blank">OpenTracing</a> which is a vendor-agnostic API to help developers easily instrument tracing into their codebase. Distributed tracing helps pinpoint where failures occur and what causes poor performance. <a href="{{site.baseurl}}/guides/opentracing">Read the guide for more details.</a>
pt_br: O Quarkus utiliza o <a href="https://opentracing.io/" target="_blank">OpenTracing</a> , que é uma API independente de fornecedor para ajudar os desenvolvedores a instrumentar facilmente o rastreamento em sua base de código. O rastreamento distribuído ajuda a identificar onde ocorrem falhas e o que causa o baixo desempenho. <a href="{{site.baseurl}}/guides/opentracing">Leia o guia para obter mais detalhes.</a>

source: Quarkus utilizes the <a href="https://micrometer.io/" target="_blank">Micrometer</a> metrics library for runtime and application metrics. It provides a simple facade for the most popular monitoring systems to instrument your JVM-based application code without vendor lock-in. Application-specific and built-in metrics can be exposed using Micrometer. <a href="{{site.baseurl}}/guides/micrometer#support-for-the-microprofile-metrics-api">Read the guide for more details.</a>
pt_br: O Quarkus utiliza a biblioteca de métricas <a href="https://micrometer.io/" target="_blank">Micrometer</a> para métricas de tempo de execução e de aplicativos. Ele fornece uma fachada simples para os sistemas de monitoramento mais populares para instrumentar seu código de aplicativo baseado em JVM sem ficar preso a um fornecedor específico. Métricas internas e específicas do aplicativo podem ser expostas usando o Micrometer. <a href="{{site.baseurl}}/guides/micrometer#support-for-the-microprofile-metrics-api">Leia o guia para obter mais detalhes.</a>

source: Quarkus was built from the ground up for Kubernetes making it easy to deploy applications without having to understand all of the complexities of the platform. Quarkus allows developers to automatically generate Kubernetes resources including building and deploying container images without having to manually create YAML files.
pt_br: O Quarkus foi criado do zero para o Kubernetes, facilitando a implantação de aplicativos sem precisar entender todas as complexidades da plataforma. O Quarkus permite que os desenvolvedores gerem automaticamente recursos do Kubernetes, incluindo a criação e implantação de imagens de contêiner sem a necessidade de criar manualmente arquivos YAML.

source: Quarkus was created to enable Java developers to create applications for a modern, cloud-native world. Quarkus is a Kubernetes-native Java framework tailored for GraalVM and HotSpot, crafted from best-of-breed Java libraries and standards. The goal is to make Java the leading platform in Kubernetes and serverless environments while offering developers a framework to address a wider range of distributed application architectures.
pt_br: O Quarkus foi criado para permitir que os desenvolvedores Java criem aplicativos para um mundo moderno e nativo da nuvem. O Quarkus é uma estrutura Java nativa do Kubernetes adaptada para GraalVM e HotSpot, criada a partir das melhores bibliotecas e padrões Java. O objetivo é tornar o Java a plataforma líder em Kubernetes e ambientes sem servidor, oferecendo aos desenvolvedores uma estrutura para abordar uma ampla gama de arquiteturas de aplicações distribuídas.

source: Quarkus's Collaborative Community Forum
pt_br: Fórum da Comunidade Colaborativa do Quarkus

source: Quickly Bootstrap Your Application
pt_br: Inicialize rapidamente sua aplicação

source: Qute Reference Guide
pt_br: Guia de Referência do Qute

source: RabbitMQ Dev Services
pt_br: Dev Services RabbitMQ

source: RabbitMQ Reference
pt_br: Referência do RabbitMQ

source: Re-augment a Quarkus Application
pt_br: Reajustar uma aplicação Quarkus

source: Reactive
pt_br: Reativo

source: Reactive API for Hibernate ORM
pt_br: API reativa para Hibernate ORM

source: Reactive SQL Clients
pt_br: Clientes SQL reativos

source: Reactive code on event loop
pt_br: Código reativo no event loop

source: Reactive extensions
pt_br: Extensões reativas

source: Read the Guide
pt_br: Leia o Guia

source: Red Hat Build of Quarkus
pt_br: Red Hat Build do Quarkus

source: Redis Cache
pt_br: Cache Redis

source: Redis Client
pt_br: Cliente Redis

source: Redis Dev Services
pt_br: Dev Services Redis

source: Redis Reference
pt_br: Referência do Redis

source: Redis as cache backend
pt_br: Redis como backend cache

source: Redpanda transactions does not support exactly-once processing.
pt_br: As transações Redpanda não suportam um processamento exatamente único.

source: Reduction in Reflection Usage
pt_br: Redução no uso de reflexão

source: Reference guide for OpenID Connect and OAuth2 Client and Filters.
pt_br: Guia de referência para clientes e filtros OpenID Connect e OAuth2.

source: Reference guide for SmallRye Reactive Messaging and AMQP.
pt_br: Guia de referência para SmallRye Reactive Messaging e AMQP.

source: Reference guide for SmallRye Reactive Messaging and RabbitMQ.
pt_br: Guia de referência para SmallRye Reactive Messaging e RabbitMQ.

source: References
pt_br: Referências

source: Register the output of the step executing `./mvnw ...` command (i.e. directory `target/native-image`) as a build artifact,
pt_br: Registar a saída da etapa que executa o comando `./mvnw …​` (ou seja, o diretório `target/native-image`) como um artefacto de construção,

source: Register the output of the step executing the `native-image ...` command (i.e. files matching `target/*runner`) as build artifact.
pt_br: Registar a saída do passo que executa o comando `native-image …​` (ou seja, arquivos que correspondem a `target/*runner`) como artefacto de build.

source: Release the connection if it is not used for more than [connectionMaxIdleSeconds] seconds. If [connectionMaxIdleSeconds] < 0, disabled the feature that auto release the idle connections
pt_br: Solte a conexão se ela não for usada por mais de [connectionMaxIdleSeconds] segundos. Se [connectionMaxIdleSeconds] < 0, desabilitado o recurso que libera automaticamente as conexões ociosas

source: Releasing your Quarkus applications with JReleaser
pt_br: Liberando seus aplicativos Quarkus com o JReleaser

source: Remote Development
pt_br: Desenvolvimento remoto

source: Require this artifact in the step executing the `native-image ...` command, and
pt_br: Exigir este artefacto no passo que executa o comando `native-image …​`, e

source: Resource registration
pt_br: Registo de recursos

source: Restoration is limited to 2 seconds.
pt_br: A restauração é limitada a 2 segundos.

source: Retrieve a new increment
pt_br: Recuperar um novo incremento

source: Retrieve the commands to manipulate the counters
pt_br: Recuperar os comandos para manipular os contadores

source: Retrieve the commands to manipulate the keys
pt_br: Recuperar os comandos para manipular as chaves

source: Retrieve the value associated with the given key. It `null`, returns 0.
pt_br: Recupera o valor associado à chave indicada. Se `null`, retorna 0.

source: Risk of pinning, monopolization and under-efficient object pooling
pt_br: Risco de fixação (pinning), monopolização e agrupamento de objetos pouco eficiente

source: Roughly 15 minutes
pt_br: Cerca de 15 minutos

source: Roughly {prerequisites-time}
pt_br: Mais ou menos {prerequisites-time}
